css/animation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>animation</title>
<!-- 2017-02-26 Sun 18:28 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="杜猛" />
</head>
<body>
<div id="content">
<h1 class="title">animation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. property</a></li>
<li><a href="#sec-2">2. transform</a></li>
<li><a href="#sec-3">3. transition</a>
<ul>
<li><a href="#sec-3-1">3.1. transition-duration</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> property</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-css"><span style="color: #DCDCCC; font-weight: bold;">@keyframes</span> frameName<span style="color: #DCDCCC;">{</span>
    <span style="color: #93E0E3;">from </span><span style="color: #BFEBBF;">{</span><span style="color: #DFAF8F;">property</span>: value;  <span style="color: #BFEBBF;">}</span>
    <span style="color: #93E0E3;">to </span><span style="color: #BFEBBF;">{</span><span style="color: #DFAF8F;">property</span>: value1; <span style="color: #BFEBBF;">}</span>
<span style="color: #DCDCCC;">}</span>
//or
<span style="color: #DCDCCC; font-weight: bold;">@keyframes</span> frameName<span style="color: #DCDCCC;">{</span>
    <span style="color: #93E0E3;">0% </span><span style="color: #BFEBBF;">{</span><span style="color: #DFAF8F;">property</span>: value;  <span style="color: #BFEBBF;">}</span>
    <span style="color: #93E0E3;">20% </span><span style="color: #BFEBBF;">{</span><span style="color: #DFAF8F;">property</span>: value1; <span style="color: #BFEBBF;">}</span>
    <span style="color: #93E0E3;">100% </span><span style="color: #BFEBBF;">{</span><span style="color: #DFAF8F;">property</span>: value2; <span style="color: #BFEBBF;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<pre class="example">
Initial value	as each of the properties of the  shorthand:

animation-name: none
animation-duration: 0s
animation-timing-function: ease
animation-delay: 0s
animation-iteration-count: 1
animation-direction: normal
animation-fill-mode: none
animation-play-state: running
//handy
animation: [name] [duration]
</pre>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> transform</h2>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> transition</h2>
<div class="outline-text-2" id="text-3">
<p>
If you want add transition between normal state and hover or focus state, then add the transition property in <b><b>normal</b></b> state.
</p>
<div class="org-src-container">

<pre class="src src-css"><span style="color: #93E0E3;">input</span><span style="color: #DCDCCC;">{</span>
  <span style="color: #DFAF8F;">border-style</span>:solid;
  <span style="color: #DFAF8F;">border-color</span>:<span style="color: #ffffff; background-color: #FF0000;">red</span>;
  <span style="color: #DFAF8F;">transition</span>: border-color 1s;
<span style="color: #DCDCCC;">}</span>
<span style="color: #93E0E3;">input:focus</span><span style="color: #DCDCCC;">{</span>
    <span style="color: #DFAF8F;">border-color</span>:<span style="color: #ffffff; background-color: #008000;">green</span>;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
<p>
Then there will have transition both on focus and lose focus.
And for sure you can add another transition to make different effect between two states.
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> transition-duration</h3>
<div class="outline-text-3" id="text-3-1">
<p>
The property `transition-duration` can used not only when explicitly declared the transition, but also there are two state to transist between.
Like a normal and hover state, you could just write:
</p>
<div class="org-src-container">

<pre class="src src-css"><span style="color: #93E0E3;">.class</span><span style="color: #DCDCCC;">{</span>
    <span style="color: #DFAF8F;">transition-duration</span>: 1s;
<span style="color: #DCDCCC;">}</span>
<span style="color: #93E0E3;">.class:hover</span><span style="color: #DCDCCC;">{</span>
   <span style="color: #DFAF8F;">skdfjks</span>: sd;

<span style="color: #DCDCCC;">}</span>
</pre>
</div>
<p>
That will constraint the duration time when hover the element.
<b>Tips</b>:
</p>
<blockquote>
<ul class="org-ul">
<li>The `transition-duration` is the time from other state to this state.
</li>
<li>See a detail in [[<a href="http://www.w3schools.com/css/tryit.asp?filename=trycss_buttons_animate2">http://www.w3schools.com/css/tryit.asp?filename=trycss_buttons_animate2</a>] [button animation]]
</li>
</ul>
</blockquote>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 杜猛</p>
<p class="date">Created: 2017-02-26 Sun 18:28</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"></p>
</div>
</body>
</html>
